# Electrical System Hot Conductor Size Property

Source: https://www.revitapidocs.com/2026/15b83037-f5d7-4f4d-70bf-968c65b517d4.htm

---

| Electrical System Hot Conductor Size Property |
| --- |

The size of a Hot Conductor in the Electrical System.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ElementId HotConductorSize { get; }
```

```
Public ReadOnly Property HotConductorSize As ElementId
	Get
```

```
public:
property ElementId^ HotConductorSize {
	ElementId^ get ();
}
```

```
member HotConductorSize : ElementId with get
```

#### Property Value

ElementId Exceptions

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This property only available when System Type is Power! |

Remarks Each Hot Conductor has the same size in the Electrical System. See Also

#### Reference

ElectricalSystem Class Autodesk.Revit.DB.Electrical Namespace